Repository: we-kode/mml.app
Catalog: lib/l10n/mml_app_*.arb
Languages: de

# appTitle
source: My Media Lib
de: Meine Mediathek

# badCertificate
source: An certificate error occurred!
de: Es ist ein Zertifikatfehler aufgetreten!

# unexpectedError
source: An unexpected error occurred: {message}
de: Es ist ein unerwarterter Fehler aufgetreten: {message}

# forbidden
source: You have not the necessary rights, to execute this action!
de: Sie haben nicht die notwendigen Rechte, die Aktion auszuführen!

source: Done
de: Fertig

source: Skip
de: Überspringen

# registrationTitle
source: Registration
de: Registrierung

# registrationScan
source: To register your device, scan the QR-Code in the administration.
de: Scannen Sie den QR-Code in der Administration, um Ihr Gerät zu registrieren.

# registrationError
source: An error occurred during registration. Please retry again!
de: Ein Fehler ist beim Registrieren aufgetreten. Versuchen Sie es erneut!

# registrationSuccess
source: Device has been successfully registered!
de: Gerät wurde erfolgreich registriert!

# registrationProgress
source: Device registration is running...
de: Gerät wird registriert...

# registrationEnterName
source: To register, enter your name.
de: Geben Sie Ihren Namen ein, um sich zu registrieren.

# registrationRSA
source: Security key is generated. This may take a moment.
de: Sicherheitsschlüssel wird generiert. Das kann einen Augenblick dauern.

# reRegister
source: Your registration is not valid any more. Re-Register your device!
de: Ihre Registrierung ist nicht mehr gültig. Registrieren Sie Ihr Gerät erneut!

source: Records
de: Aufnahmen

source: Settings
de: Einstellungen

# playlist
source: Saved tracks
de: Gespeicherte Titel

source: Next
de: Weiter

source: First name
de: Vorname

source: Last name
de: Nachname

# invalidFirstName
source: Please enter a first name!
de: Bitte geben Sie einen Vornamen an!

# invalidLastName
source: Please enter a last name!
de: Bitte geben Sie einen Nachnamen an!

# notReachable
source: The server is not reachable! Please check your network connection!
de: Der Server ist nicht erreichbar! Bitte prüfen Sie Ihre Netzwerkverbindung!

source: Change server connection
de: Server-Verbindung ändern

source: Remove registration
de: Registrierung löschen

source: Privacy Policy
de: Datenschutzerklärung

source: Legal Information
de: Impressum

source: Licenses
de: Lizenzen

# updateConnectionSettingsTitle
source: Change server connection
de: Server-Verbindung ändern

# updateConnectionSettingsScan
source: To change the settings, scan the QR-Code in the administration.
de: Scannen Sie den QR-Code in der Administration, um die Einstellungen zu ändern.

# updateConnectionSettingsError
source: An error occurred during change. Please retry again!
de: Ein Fehler ist bei der Änderung aufgetreten. Versuchen Sie es erneut!

# updateConnectionSettingsSuccess
source: Settings were successfully changed!
de: Einstellungen wurden erfolgreich geändert!

# updateConnectionSettingsProgress
source: Changing settings...
de: Einstellungen werden geändert...

# introTitleRegister
source: Register
de: Registrieren

# introTextRegister
source: Scan the QR code in the administration to register your device.
de: Scannen Sie den QR-Code in der Administration, um Ihr Gerät zu registrieren.

# introTitleRecords
source: Listen
de: Hören

# introTextRecords
source: Access available audio recordings, filter them as you like and listen to them.
de: Greifen Sie auf verfügbare Audio-Aufnahmen zu, filtern Sie diese nach Belieben und hören Sie diese an.

# introTitlePlaylist
source: Take with you
de: Mitnehmen

# introTextPlaylist
source: Add your favorite recordings to offline playlists and listen to them even if there is no Internet at the moment.
de: Fügen Sie Ihre lieblings Aufnahmen zu offline Playlisten hinzu und hören Sie diese auch wenn gerade kein Internet da ist.

source: Unknown
de: Unbekannt

# save
source: Apply
de: Anwenden

source: Cancel
de: Abbrechen

# noData
source: No records were found!
de: Keine Datensätze wurden gefunden!

source: Reload
de: Neu laden

source: Date
de: Datum

source: Artist
de: Interpret

source: Add
de: Hinzufügen

# notFound
source: The requested record wasn't found!
de: Der aufgerufene Datensatz wurde nicht gefunden!

source: Edit playlist
de: Wiedergabeliste bearbeiten

source: Add playlist
de: Wiedergabeliste hinzufügen

# invalidDisplayName
source: Please enter a name!
de: Bitte geben Sie einen Namen an!

# playlistUniqueConstraintFailed
source: Playlist already exists.
de: Wiedergabeliste ist bereits vorhanden.

source: Remove
de: Löschen

source: Yes
de: Ja

# deleteConfirmation
source: Are you really want to delete the selected records?
de: Möchten Sie tatsächlich die gewählten Datensätze löschen?

# fileNotFound
source: File could not be found. Add the recording to a playlist again.
de: Datei konnte nicht gefunden werden. Fügen Sie die Aufnahme erneut zu einer Playlist hinzu.

# downloadError
source: Download failed. Check your connection and storage space and try again.
de: Download fehlgeschlagen. Überprüfen Sie ihre Verbindung und Speicherplatz und versuchen Sie es erneut.

source: back
de: zurück

source: Folder
de: Ordner

source: Language
de: Sprache

# notReachableRecord
source: The record could not be loaded! Please retry later.
de: Die Aufnahme konnte nicht geladen werden! Versuchen Sie es später nocheinmal.
